# Belajar Data Sience

In [5]:
print('Hello World')

Hello World

### Membuat Data Terstruktur Menggunakan 3 Cara

In [6]:
import pandas as pd

In [7]:
isi = {'Nama' : ['Rendika', 'Bae Suzy', 'Jordi', 'Melvern'], 'sex' : ['Laki-laki','Perempuan','Laki-laki','Laki-Laki'], 'status' : ['Menikah','Single','Menikah','Single'], 'UTS' : [100,99,97,95], 'UAS' : [99,98,96,94]}

In [8]:
df = pd.DataFrame(data = isi)

In [9]:
print(df)

       Nama        sex   status  UTS  UAS
0   Rendika  Laki-laki  Menikah  100   99
1  Bae Suzy  Perempuan   Single   99   98
2     Jordi  Laki-laki  Menikah   97   96
3   Melvern  Laki-Laki   Single   95   94

In [10]:
df = pd.DataFrame(data = isi)
print (df)

       Nama        sex   status  UTS  UAS
0   Rendika  Laki-laki  Menikah  100   99
1  Bae Suzy  Perempuan   Single   99   98
2     Jordi  Laki-laki  Menikah   97   96
3   Melvern  Laki-Laki   Single   95   94

In [11]:
data= pd.read_csv('C:/Users/rendi/Pictures/Institut Teknologi Telkom Surabaya/Belajar Coding/Data Frame 1.csv', header = 0)
print(data)

       Nama  Umur        Sex   Status  UTS  UAS
0   Rendika    27  Laki-Laki  Menikah  100   99
1  Bae Suzy    23  Perempuan  Menikah   99   98
2     Jordi    29  Laki-Laki   Single   97   96
3   Melvern    30  Laki-Laki   Single   95   94

In [12]:
Nama = pd.Series (['Rendika', 'Bae Suzy', 'Jordi', 'Melvern'])
Asal = pd.Series (['Sleman', 'Korea Selatan', 'Bogor', 'Bojonegoro'])
UTS = ([100,99,97,95])
UAS = ([99,98,96,94])
print(Asal)

0           Sleman
1    Korea Selatan
2            Bogor
3       Bojonegoro
dtype: object

In [13]:
print(Nama)

0     Rendika
1    Bae Suzy
2       Jordi
3     Melvern
dtype: object

In [14]:
print(UTS)

[100, 99, 97, 95]

### Olah Data - Pengoprasian Pola Bilangan Pada Data

#### Mean Sum

In [15]:
df['RataNilai'] = df.mean(axis = 1)
print (df)

       Nama        sex   status  UTS  UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100   99       99.5
1  Bae Suzy  Perempuan   Single   99   98       98.5
2     Jordi  Laki-laki  Menikah   97   96       96.5
3   Melvern  Laki-Laki   Single   95   94       94.5

In [16]:
df.sum(axis = 1)

0    298.5
1    295.5
2    289.5
3    283.5
dtype: float64

In [17]:
df.sum(axis=0)

Nama                  RendikaBae SuzyJordiMelvern
sex          Laki-lakiPerempuanLaki-lakiLaki-Laki
status                 MenikahSingleMenikahSingle
UTS                                           391
UAS                                           387
RataNilai                                   389.0
dtype: object

## Menghapus Kolom

#### Syntaks = del ab ['Nama Kolom Yang Mau Dihapuskan']

## Ambil Data Perkolom

In [18]:
print (df)

       Nama        sex   status  UTS  UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100   99       99.5
1  Bae Suzy  Perempuan   Single   99   98       98.5
2     Jordi  Laki-laki  Menikah   97   96       96.5
3   Melvern  Laki-Laki   Single   95   94       94.5

In [19]:
df.Nama

0     Rendika
1    Bae Suzy
2       Jordi
3     Melvern
Name: Nama, dtype: object

In [20]:
df.RataNilai

0    99.5
1    98.5
2    96.5
3    94.5
Name: RataNilai, dtype: float64

## Mengganti Data

In [21]:
df = df.replace('Jordi','Naruto')
print (df)

       Nama        sex   status  UTS  UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100   99       99.5
1  Bae Suzy  Perempuan   Single   99   98       98.5
2    Naruto  Laki-laki  Menikah   97   96       96.5
3   Melvern  Laki-Laki   Single   95   94       94.5

In [22]:
df = df.replace({'Melvern' : 'Sasuke', 94 : 98})
print (df)

       Nama        sex   status  UTS  UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100   99       99.5
1  Bae Suzy  Perempuan   Single   99   98       98.5
2    Naruto  Laki-laki  Menikah   97   96       96.5
3    Sasuke  Laki-Laki   Single   95   98       94.5

In [23]:
df.loc[0,'UAS'] = 100
print (df)

       Nama        sex   status  UTS  UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100  100       99.5
1  Bae Suzy  Perempuan   Single   99   98       98.5
2    Naruto  Laki-laki  Menikah   97   96       96.5
3    Sasuke  Laki-Laki   Single   95   98       94.5

In [24]:
df ['RataNilai'] = df.mean(axis = 1)
print(df)

       Nama        sex   status  UTS  UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100  100  99.833333
1  Bae Suzy  Perempuan   Single   99   98  98.500000
2    Naruto  Laki-laki  Menikah   97   96  96.500000
3    Sasuke  Laki-Laki   Single   95   98  95.833333

## Cek Data Kosong

In [25]:
df.isnull()

    Nama    sex  status    UTS    UAS  RataNilai
0  False  False   False  False  False      False
1  False  False   False  False  False      False
2  False  False   False  False  False      False
3  False  False   False  False  False      False

In [26]:
df.notnull()

   Nama   sex  status   UTS   UAS  RataNilai
0  True  True    True  True  True       True
1  True  True    True  True  True       True
2  True  True    True  True  True       True
3  True  True    True  True  True       True

In [27]:
df.loc[2,'UAS'] = None
print (df)

       Nama        sex   status  UTS    UAS  RataNilai
0   Rendika  Laki-laki  Menikah  100  100.0  99.833333
1  Bae Suzy  Perempuan   Single   99   98.0  98.500000
2    Naruto  Laki-laki  Menikah   97    NaN  96.500000
3    Sasuke  Laki-Laki   Single   95   98.0  95.833333

In [28]:
df.notnull()

   Nama   sex  status   UTS    UAS  RataNilai
0  True  True    True  True   True       True
1  True  True    True  True   True       True
2  True  True    True  True  False       True
3  True  True    True  True   True       True

In [29]:
df = df.replace ({'Rapmon':'Ji Chang Wook','Sasuke':'Lee Min Ho'})
print(df)

         Nama        sex   status  UTS    UAS  RataNilai
0     Rendika  Laki-laki  Menikah  100  100.0  99.833333
1    Bae Suzy  Perempuan   Single   99   98.0  98.500000
2      Naruto  Laki-laki  Menikah   97    NaN  96.500000
3  Lee Min Ho  Laki-Laki   Single   95   98.0  95.833333


## Penangan Data Kosong

In [30]:
df.fillna(0)

         Nama        sex   status  UTS    UAS  RataNilai
0     Rendika  Laki-laki  Menikah  100  100.0  99.833333
1    Bae Suzy  Perempuan   Single   99   98.0  98.500000
2      Naruto  Laki-laki  Menikah   97    0.0  96.500000
3  Lee Min Ho  Laki-Laki   Single   95   98.0  95.833333

In [31]:
df.dropna()

         Nama        sex   status  UTS    UAS  RataNilai
0     Rendika  Laki-laki  Menikah  100  100.0  99.833333
1    Bae Suzy  Perempuan   Single   99   98.0  98.500000
3  Lee Min Ho  Laki-Laki   Single   95   98.0  95.833333

In [32]:
df.fillna(df.UAS.mean(axis=0))

         Nama        sex   status  UTS         UAS  RataNilai
0     Rendika  Laki-laki  Menikah  100  100.000000  99.833333
1    Bae Suzy  Perempuan   Single   99   98.000000  98.500000
2      Naruto  Laki-laki  Menikah   97   98.666667  96.500000
3  Lee Min Ho  Laki-Laki   Single   95   98.000000  95.833333

# Bikin Data Orang Terfavorite Di Dunia VersiKu (coba coba)

In [33]:
people = {'Nama' : ['bae suzy','Dwayne Johnson','Lebron James','Ji Chang Wook','Cristiano Ronaldo'], 'Age' : [26,49,36,34,36], 'Height' : [168,196,206,182,187], ' Jenis Kelamin' : ['Perempuan','Laki-Laki','Laki-Laki','Laki-Laki','Laki-Laki'], 'Pekerjaan' : ['Aktris','Aktor','Pemain NBA','Aktor','Pemain Bola']}

In [34]:
ab = pd.DataFrame(data = people)
print (ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan
0           bae suzy   26     168      Perempuan       Aktris
1     Dwayne Johnson   49     196      Laki-Laki        Aktor
2       Lebron James   36     206      Laki-Laki   Pemain NBA
3      Ji Chang Wook   34     182      Laki-Laki        Aktor
4  Cristiano Ronaldo   36     187      Laki-Laki  Pemain Bola

In [35]:
ab['Status'] = ['Single','Taken','Taken','Single','Taken']
print (ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status
0           bae suzy   26     168      Perempuan       Aktris  Single
1     Dwayne Johnson   49     196      Laki-Laki        Aktor   Taken
2       Lebron James   36     206      Laki-Laki   Pemain NBA   Taken
3      Ji Chang Wook   34     182      Laki-Laki        Aktor  Single
4  Cristiano Ronaldo   36     187      Laki-Laki  Pemain Bola   Taken

In [36]:
ab.isnull()

    Nama    Age  Height   Jenis Kelamin  Pekerjaan  Status
0  False  False   False           False      False   False
1  False  False   False           False      False   False
2  False  False   False           False      False   False
3  False  False   False           False      False   False
4  False  False   False           False      False   False

In [37]:
ab.notnull()

   Nama   Age  Height   Jenis Kelamin  Pekerjaan  Status
0  True  True    True            True       True    True
1  True  True    True            True       True    True
2  True  True    True            True       True    True
3  True  True    True            True       True    True
4  True  True    True            True       True    True

In [38]:
ab.loc[4,'Height'] = 185
print (ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status
0           bae suzy   26     168      Perempuan       Aktris  Single
1     Dwayne Johnson   49     196      Laki-Laki        Aktor   Taken
2       Lebron James   36     206      Laki-Laki   Pemain NBA   Taken
3      Ji Chang Wook   34     182      Laki-Laki        Aktor  Single
4  Cristiano Ronaldo   36     185      Laki-Laki  Pemain Bola   Taken

In [39]:
ab.T

,0,1,2,3,4
Nama,bae suzy,Dwayne Johnson,Lebron James,Ji Chang Wook,Cristiano Ronaldo
Age,26,49,36,34,36
Height,168,196,206,182,185
Jenis Kelamin,Perempuan,Laki-Laki,Laki-Laki,Laki-Laki,Laki-Laki
Pekerjaan,Aktris,Aktor,Pemain NBA,Aktor,Pemain Bola
Status,Single,Taken,Taken,Single,Taken

In [40]:
print(ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status
0           bae suzy   26     168      Perempuan       Aktris  Single
1     Dwayne Johnson   49     196      Laki-Laki        Aktor   Taken
2       Lebron James   36     206      Laki-Laki   Pemain NBA   Taken
3      Ji Chang Wook   34     182      Laki-Laki        Aktor  Single
4  Cristiano Ronaldo   36     185      Laki-Laki  Pemain Bola   Taken

In [41]:
ab = ab.replace({'Perempuan' : 'Wanita', 'Laki-Laki' : 'Pria'})
print(ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status
0           bae suzy   26     168         Wanita       Aktris  Single
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

In [42]:
ab.loc[0,'Status'] = None
print(ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status
0           bae suzy   26     168         Wanita       Aktris    None
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

In [43]:
ab['Agama'] = ['Buddha','kristen','Katotik','Buddha','Kristen']
print(ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status    Agama
0           bae suzy   26     168         Wanita       Aktris    None   Buddha
1     Dwayne Johnson   49     196           Pria        Aktor   Taken  kristen
2       Lebron James   36     206           Pria   Pemain NBA   Taken  Katotik
3      Ji Chang Wook   34     182           Pria        Aktor  Single   Buddha
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken  Kristen

In [44]:
ab['Net Worth'] = ['$30 million','$400 million','$850 million','$ 5 million','$1 billion']
print (ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status  \
0           bae suzy   26     168         Wanita       Aktris    None
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

     Agama     Net Worth
0   Buddha   $30 million
1  kristen  $400 million
2  Katotik  $850 million
3   Buddha   $ 5 million
4  Kristen    $1 billion

In [45]:
print (ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status  \
0           bae suzy   26     168         Wanita       Aktris    None
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

     Agama     Net Worth
0   Buddha   $30 million
1  kristen  $400 million
2  Katotik  $850 million
3   Buddha   $ 5 million
4  Kristen    $1 billion

In [46]:
print(ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status  \
0           bae suzy   26     168         Wanita       Aktris    None
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

     Agama     Net Worth
0   Buddha   $30 million
1  kristen  $400 million
2  Katotik  $850 million
3   Buddha   $ 5 million
4  Kristen    $1 billion

In [47]:
ab['State'] = ['Korea Selatan','America','America','Korea Selatan','Spanyol']
print (ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status  \
0           bae suzy   26     168         Wanita       Aktris    None
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

     Agama     Net Worth          State
0   Buddha   $30 million  Korea Selatan
1  kristen  $400 million        America
2  Katotik  $850 million        America
3   Buddha   $ 5 million  Korea Selatan
4  Kristen    $1 billion        Spanyol

In [48]:
ab.isnull()

,Nama,Age,Height,Jenis Kelamin,Pekerjaan,Status,Agama,Net Worth,State
0,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False

In [49]:
ab.dropna()

,Nama,Age,Height,Jenis Kelamin,Pekerjaan,Status,Agama,Net Worth,State
1,Dwayne Johnson,49,196,Pria,Aktor,Taken,kristen,$400 million,America
2,Lebron James,36,206,Pria,Pemain NBA,Taken,Katotik,$850 million,America
3,Ji Chang Wook,34,182,Pria,Aktor,Single,Buddha,$ 5 million,Korea Selatan
4,Cristiano Ronaldo,36,185,Pria,Pemain Bola,Taken,Kristen,$1 billion,Spanyol

In [50]:
print(ab)

                Nama  Age  Height  Jenis Kelamin    Pekerjaan  Status  \
0           bae suzy   26     168         Wanita       Aktris    None
1     Dwayne Johnson   49     196           Pria        Aktor   Taken
2       Lebron James   36     206           Pria   Pemain NBA   Taken
3      Ji Chang Wook   34     182           Pria        Aktor  Single
4  Cristiano Ronaldo   36     185           Pria  Pemain Bola   Taken

     Agama     Net Worth          State
0   Buddha   $30 million  Korea Selatan
1  kristen  $400 million        America
2  Katotik  $850 million        America
3   Buddha   $ 5 million  Korea Selatan
4  Kristen    $1 billion        Spanyol

In [51]:
ab.sum(axis=1)

0    194
1    245
2    242
3    216
4    221
dtype: int64

In [52]:
ab['Pekerjaan'].unique()

array(['Aktris', 'Aktor', 'Pemain NBA', 'Pemain Bola'], dtype=object)

In [53]:
ab.shape

(5, 9)

In [54]:
ab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Nama            5 non-null      object
 1   Age             5 non-null      int64
 2   Height          5 non-null      int64
 3    Jenis Kelamin  5 non-null      object
 4   Pekerjaan       5 non-null      object
 5   Status          4 non-null      object
 6   Agama           5 non-null      object
 7   Net Worth       5 non-null      object
 8   State           5 non-null      object
dtypes: int64(2), object(7)
memory usage: 488.0+ bytes

In [55]:
ab.describe()

             Age     Height
count   5.000000    5.00000
mean   36.200000  187.40000
std     8.258329   14.41527
min    26.000000  168.00000
25%    34.000000  182.00000
50%    36.000000  185.00000
75%    36.000000  196.00000
max    49.000000  206.00000

In [56]:
ab.head()

,Nama,Age,Height,Jenis Kelamin,Pekerjaan,Status,Agama,Net Worth,State
0,bae suzy,26,168,Wanita,Aktris,None,Buddha,$30 million,Korea Selatan
1,Dwayne Johnson,49,196,Pria,Aktor,Taken,kristen,$400 million,America
2,Lebron James,36,206,Pria,Pemain NBA,Taken,Katotik,$850 million,America
3,Ji Chang Wook,34,182,Pria,Aktor,Single,Buddha,$ 5 million,Korea Selatan
4,Cristiano Ronaldo,36,185,Pria,Pemain Bola,Taken,Kristen,$1 billion,Spanyol

In [57]:
!dir

 Volume in drive C is Windows
 Volume Serial Number is 4A44-3A12

 Directory of C:\Users\rendi\ITTS DATA SCIENCE

22/11/2021  23:08    <DIR>          .
17/11/2021  03:49    <DIR>          ..
22/11/2021  23:00    <DIR>          .ipynb_checkpoints
21/10/2021  13:14             4.164 Alpro - LIST .ipynb
14/10/2021  16:43             1.774 AlPro Praktek Minggu Pertama .ipynb
18/10/2021  09:55             3.037 AlPro Teori 1.ipynb
28/10/2021  13:06             3.500 CONTOH IF NESTED.ipynb
22/11/2021  23:07            26.279 Data Science 1.ipynb
12/09/2021  03:00    <DIR>          dolanan-data-main
18/09/2021  08:51    <DIR>          dolanan-data-main Complete
08/11/2021  10:13             8.330 Function 1.ipynb
11/11/2021  13:19             3.728 Function Kodingan Kak Naufal.ipynb
11/11/2021  15:16             3.645 Kalkulator Function Lengkap.ipynb
21/10/2021  15:01             5.087 Kalkulator.ipynb
04/11/2021  16:06             7.494 Kumpulan Tugas W - 5 Anak- Anak.ipynb
21/11/2021  13:00             4.676 Membuat Segitiga Dari Range Python.ipynb
25/10/2021  09:58             8.528 Percabangan IF ELSE ELIF.ipynb
01/11/2021  11:19            11.415 Perulangan For.ipynb
28/10/2021  14:43             6.174 Praktikum W-4 IF NESTED.ipynb
18/10/2021  10:32             1.050 Tugas Alpro Slisih Umur Mutlak Version.ipynb
01/11/2021  13:23             2.252 Tugas Alpro Week 5 Perulangan.ipynb
04/11/2021  15:03             1.754 TUGAS FIBNACCI & DERET ANGKA SEGITIGA.ipynb
04/11/2021  15:02             5.784 TUGAS PRAKTIKUM W - 5.ipynb
18/11/2021  14:13             6.150 Untitled.ipynb
22/11/2021  23:08            10.207 Untitled1.ipynb
              20 File(s)        125.028 bytes
               5 Dir(s)  57.408.688.128 bytes free

In [58]:
ab.iloc[[0,1,3,4], :]

,Nama,Age,Height,Jenis Kelamin,Pekerjaan,Status,Agama,Net Worth,State
0,bae suzy,26,168,Wanita,Aktris,None,Buddha,$30 million,Korea Selatan
1,Dwayne Johnson,49,196,Pria,Aktor,Taken,kristen,$400 million,America
3,Ji Chang Wook,34,182,Pria,Aktor,Single,Buddha,$ 5 million,Korea Selatan
4,Cristiano Ronaldo,36,185,Pria,Pemain Bola,Taken,Kristen,$1 billion,Spanyol

In [59]:
ab.isnull().sum()

Nama              0
Age               0
Height            0
 Jenis Kelamin    0
Pekerjaan         0
Status            1
Agama             0
Net Worth         0
State             0
dtype: int64

In [60]:
ab.isnull().sum(axis=1)

0    1
1    0
2    0
3    0
4    0
dtype: int64

In [61]:
(ab.isnull().sum()).sum()

1

# Coba Coba Buat Yang Lain